mongolia19/combined_stm32/LED_DRIVER_STM32F107/Project/Template/main.c
/**
  ******************************************************************************
  * @file USART/HalfDuplex/main.c 
  * @author  MCD Application Team
  * @version V3.1.2
  * @date    09/28/2009
  * @brief   Main program body
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2009 STMicroelectronics</center></h2>
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "platform_config.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_tim.h"
#include "stm32f10x_can.h"
#include "misc.h"
#include "stm32f10x_adc.h"
#include "stm32f10x_dma.h"
/* Private typedef -----------------------------------------------------------*/
typedef enum {FAILED = 0, PASSED = !FAILED} TestStatus;

/* Private define ------------------------------------------------------------*/
#define TxBufferSize1   (countof(TxBuffer1) - 1)
#define TxBufferSize2   (countof(TxBuffer2) - 1)
//#define GPIO_Remap_CAN             GPIO_Remap2_CAN1
/* Private macro -------------------------------------------------------------*/
#define countof(a)   (sizeof(a) / sizeof(*(a)))
#define ADC1_DR_Address    ((uint32_t)0x4001244C)
#define TRUE 1
#define FALSE 0
/* Private variables ---------------------------------------------------------*/
uint8_t databuffer[8]={0};
uint8_t sendbufferall[111]={0};

//uint8_t sendbuffer7[31]={0};
volatile uint16_t ADC_ConvertedValue[4];
volatile float U1,U2,U3,U4;
float x0,y0;
int x_dir;
int y_dir;
int hitpos;
uint8_t lastlightpos=0;
uint8_t LocationSendFlag;
uint8_t shouldturnflag=0;
uint8_t ref,numofbyte,n,m,t,s,ct,cnt,k,a,code_count;

int send_data_flag;
uint8_t y_bias;
uint8_t x_bias;
int ydir=0;
int distance_valid_flag;

volatile TestStatus TransferStatus1 = FAILED, TransferStatus2 = FAILED;  
/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);
void CAN_Configuration(void);
void TIM2_Configuration(void);
void TIM3_Configuration(void);
void TIM4_Configuration(void);
void USART_Config(USART_TypeDef* USARTx);
void Delay(__IO uint32_t nCount);
void UART_OUT(uint16_t *Data,uint16_t Len);
void Decode();
unsigned char ReceiveByte(void);
u32 GetTIM_Period(u8 n);
TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint16_t BufferLength);

USART_InitTypeDef USART_InitStructure;
uint8_t TxBuffer1[7] = {0};
uint8_t TxBuffer2[] = "USART Half Duplex: USARTz -> USARTy using HalfDuplex mode";
uint8_t RxBuffer1[13]={0};
uint8_t RxBuffer_wireless[13]={0};

uint8_t TxCounter1 = 0, RxCounter1 = 0,data=0,rec_f=0,n=0,m=0;
uint8_t RxCounter_wireless=0;

extern CanTxMsg TxMessage;

int distance_valid_flag;
int send_data_flag;
void ADC1_Init(void);
void ADC1_GPIO_Config(void);
void ADC1_Mode_Config(void);
uint8_t getmax(float u1,float u2,float u3,float u4);
TIM_TimeBaseInitTypeDef  TIM3_TimeBaseStructure;
TIM_TimeBaseInitTypeDef  TIM4_TimeBaseStructure;
TIM_OCInitTypeDef  TIM3_OCInitStructure;
TIM_ICInitTypeDef  TIM_ICInitStructure;
USART_InitTypeDef USART_InitStructure;
USART_InitTypeDef USART_InitStruct;
USART_ClockInitTypeDef USART_ClockInitStruct; 

/* Private functions ---------------------------------------------------------*/

/**
  * @brief   Main program
  * @param  None
  * @retval None
  */
int main(void)////in use
{

  RCC_Configuration();
  GPIO_Configuration();
  CAN_Configuration();	
  
 // TIM4_Configuration();
  
  CAN_ITConfig(CAN1, CAN_IT_FMP0, ENABLE);
  //CAN_ITConfig(CAN2, CAN_IT_FMP0, ENABLE);
  USART_Config(USART1);
  USART_Cmd(USART1, ENABLE);
  
  USART_Config(USART3);
  USART_Cmd(USART3, ENABLE);
  //GPIO_ResetBits(GPIOB, GPIO_Pin_8|GPIO_Pin_9);
  //GPIO_SetBits(GPIOB, GPIO_Pin_6|GPIO_Pin_7);	
  
  USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
  
  USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
  NVIC_Configuration();
  //USART_ITConfig(USART2, USART_IT_RXNE, DISABLE);
  GPIO_ResetBits(GPIOC, GPIO_Pin_6|GPIO_Pin_7);
  Delay(10000000);
   //Open laser detector   USART_SendData(UART4,0xdd);
  USART_SendData(USART3,0xdd);
  while(USART_GetFlagStatus(USART3,USART_FLAG_TXE)==RESET)
  {
  }
  while (1)
  { 
//    USART_SendData(USART1,0xda);////just for test
//    while(USART1->SR&0X40==0)
//    {
//    
//    }
    GPIO_ResetBits(GPIOC, GPIO_Pin_6);
    if(n>5||m>7){
    n=0;
    m=0;
    }
    if(rec_f==1)
      {
        USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);
	rec_f=0;
       /* TxMessage.ExtId=0x1210;
        TxMessage.RTR=CAN_RTR_DATA;
        TxMessage.IDE=CAN_ID_STD;
        TxMessage.DLC=5;
        TxMessage.Data[0]=TxBuffer1[1];
        TxMessage.Data[1]=TxBuffer1[2];
        TxMessage.Data[2]=TxBuffer1[3];
        TxMessage.Data[3]=TxBuffer1[4];
        TxMessage.Data[4]=TxBuffer1[5];*/
        //CAN_Transmit(CAN1, &TxMessage);
        //*******USART_ITConfig(USARTy, USART_IT_RXNE, ENABLE); 防止接收太快，导致发送的数据不准确
        //UART_OUT(&TxBuffer1[0],6); //用rs485把 初始距离数据传出去
        TxMessage.ExtId=0x111214;
        TxMessage.RTR=CAN_RTR_DATA;
        TxMessage.IDE=CAN_ID_EXT;
        TxMessage.DLC=8;
        
        for(n=0,m=0;n<5;n++,m++)
        {
          switch( TxBuffer1[n])
          {
              case 0x30:TxMessage.Data[m]=0x0;
	      break;
               case 0x31:TxMessage.Data[m]=0x01;
	      break;
               case 0x32:TxMessage.Data[m]=0x02;
	      break;
               case 0x33:TxMessage.Data[m]=0x03;
	      break;
               case 0x34:TxMessage.Data[m]=0x04;
	      break;
               case 0x35:TxMessage.Data[m]=0x05;
	      break;
               case 0x36:TxMessage.Data[m]=0x06;
	      break;
               case 0x37:TxMessage.Data[m]=0x07;
	      break;
               case 0x38:TxMessage.Data[m]=0x08;
	      break;
               case 0x39:TxMessage.Data[m]=0x09;
	      break;
          }
        }
        n=0;m=0;
        TxMessage.Data[5]=0x00;//index of Base BigRace
    
