mongolia19/combined_stm32/LED_DRIVER_STM32F107/Project/Template/main.c
}

void ADC1_Mode_Config()
{
  DMA_InitTypeDef DMA_InitStructure;
  ADC_InitTypeDef ADC_InitStructure;
  
  DMA_DeInit(DMA1_Channel1);
  DMA_InitStructure.DMA_PeripheralBaseAddr=ADC1_DR_Address;
  DMA_InitStructure.DMA_MemoryBaseAddr=(u32)&ADC_ConvertedValue;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = 4;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority = DMA_Priority_High;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(DMA1_Channel1, &DMA_InitStructure);
  
  /* Enable DMA channel1 */
  DMA_Cmd(DMA1_Channel1, ENABLE);

  
    /* ADC1 configuration ------------------------------------------------------*/
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;	//独立模式  CR1
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;		//扫描模式使能
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;	//连续转换模式使能
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;	//启动转换的外部事件--无  CR2
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;	//转换后的数据右对齐
  ADC_InitStructure.ADC_NbrOfChannel = 4;                       //转换的通道数为1
  ADC_Init(ADC1, &ADC_InitStructure);

  /* ADC1 regular channel14 configuration */ 
  //ADC12_IN8
  //ADC12_IN9
  //ADC12_IN10
  //ADC12_IN14
  ADC_RegularChannelConfig(ADC1, ADC_Channel_8, 1, ADC_SampleTime_41Cycles5);	  //通道11采样时间
  ADC_RegularChannelConfig(ADC1, ADC_Channel_9, 2, ADC_SampleTime_41Cycles5);	  
  ADC_RegularChannelConfig(ADC1, ADC_Channel_10, 3, ADC_SampleTime_41Cycles5);	  //通道11采样时间
  ADC_RegularChannelConfig(ADC1, ADC_Channel_14, 4, ADC_SampleTime_41Cycles5);	  
  
  /* Enable ADC1 DMA */															  
  ADC_DMACmd(ADC1, ENABLE);//允许ADC1进行DMA传送
  
  /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);//使能ADC1

  /* Enable ADC1 reset calibaration register */   
  ADC_ResetCalibration(ADC1);//允许ADC1复位校准寄存器 
  /* Check the end of ADC1 reset calibration register */
 // while(ADC_GetResetCalibrationStatus(ADC1));		//检测校准寄存器是否复位完成 

  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC1);//启动ADC1 校准
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1)); //检测校准是否完成 
     
  /* Start ADC1 Software Conversion */ 
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);//软件触发启动ADC1转换
}
void Delay(__IO uint32_t nCount)
{
  for(; nCount != 0; nCount--);
}

/**
  * @brief  Compares two buffers.
  * @param  pBuffer1, pBuffer2: buffers to be compared.
  * @param  BufferLength: buffer's length
  * @retval PASSED: pBuffer1 identical to pBuffer2
  *   FAILED: pBuffer1 differs from pBuffer2
  */
void UART_OUT(uint16_t *Data,uint16_t Len)
{ 
  
uint8_t i;
	for(i=0; i<Len; i++)
	{ 
          Delay(10000); 
		USART_SendData(USART2,Data[i]);
		while(USART_GetFlagStatus(USART2, USART_FLAG_TC)==RESET);   //判断是否发送完成。 
	}

}
/*************** 接收字符*****************/
unsigned char ReceiveByte(void)
{
     unsigned char i,temp1,temp2 ;
     temp1=temp2=0 ;
     for(i=0 ;i< 8 ;i++)
     {
           temp1=temp1<< 1 ;
           //GPIO_ResetBits(GPIOA, GPIO_Pin_10);//SCK = 0 ;
           //GPIO_SetBits(GPIOA, GPIO_Pin_10);//SCK = 1 ;
           //GPIO_ResetBits(GPIOA, GPIO_Pin_10);//SCK = 0 ;
           if(GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_6)==1) 
           {
             temp1++ ;
           }
     }
     for(i=0 ;i< 8 ;i++)
     {
           temp2=temp2<< 1 ;
           //GPIO_ResetBits(GPIOA, GPIO_Pin_10);//SCK = 0 ;
          // GPIO_SetBits(GPIOA, GPIO_Pin_10);//SCK = 1 ;
           //GPIO_ResetBits(GPIOA, GPIO_Pin_10);//SCK = 0 ;
           if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_6)==1) 
           {
             temp2++ ;
           }
     }
     return ((0xf0&temp1)+(0x0f&temp2)) ;
}
/**
  * @brief  Compares two buffers.
  * @param  pBuffer1, pBuffer2: buffers to be compared.
  * @param  BufferLength: buffer's length
  * @retval PASSED: pBuffer1 identical to pBuffer2
  *   FAILED: pBuffer1 differs from pBuffer2
  */
#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */ 

/**
  * @}
  */ 

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
